emacs.org
#+title:   Emacs configuration
#+author:  Tristan Mills
#+macro:    export-date (eval (format-time-string "%F %R %z" (current-time)))
#+macro:    count-words (eval (count-words (point-min) (point-max)))
#+STARTUP: overview
#+FILETAGS: emacs
#+copyright: Copyright (c) 2023 Tristan Mills <tristan@eridu.org.uk>

* License
#+begin_src emacs-lisp
;; This file is free software: you can redistribute it and/or modify it
;; under the terms of the GNU General Public License as published by the
;; Free Software Foundation, either version 3 of the License, or (at
;; your option) any later version.
;;
;; This file is distributed in the hope that it will be useful, but
;; WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
;; General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <http://www.gnu.org/licenses/>.
#+end_src

* Overview
Emacs configuration.

Currently this is used on:
- WSL2
- Windows

In the past I've used previous iterations on MacOS X, and I am experimenting with Android.

If you are looking at the public version of this, then some links will probably not work, and there will be missing sections. Do not just try and use this as is - it will probably fail

** General resources
I look at other people's configs quite a lot.
+ [[https://github.com/novoid/dot-emacs][Karl Voit's config]] Since I've been doing a pretty deep Org dive

There's also quite a few blogs where I find things
+ [[file:elfeed.org::*Emacs][My emacs blog feed]]
+ [[https://karl-voit.at/][Karl Voit]] is a very useful blog for using Org mode

+ [[https://emacsredux.com/blog/2026/04/07/stealing-from-the-best-emacs-configs/]]

*** Prot's configuration
I've taken a fair amount from Prot's fantastically documented Emacs configuration. Especially the module system.
I can't recommend going through this enough: [[https://protesilaos.com/emacs/dotemacs][<https://protesilaos.com/emacs/dotemacs>]]

Whilst there you should look at Prot's many, exceedingly useful, packages. They're fantastically documented, and the code is well organized.
You'll notice quite a few I use



* Early initialization of Emacs
=early-init.el= is run early in the Emacs startup process.  See [[info:emacs#Early Init File][emacs#Early Init File]]
#+begin_src emacs-lisp :tangle early-init.el
  ;;; ...  -*- lexical-binding: t -*-
#+end_src

** Package initialization
Setting =package-enable-at-startup= to non-nil makes installed packages available in =init.el=

#+begin_src emacs-lisp :tangle early-init.el
  ;; Initialise installed packages
  (setopt package-enable-at-startup t)

  ;; I don't care about lazy loading. I don't restart emacs very often.
  (setopt use-package-always-demand t)
#+end_src

** Initial frame settings
Turn off personal annoyances
Full-screen tip from [[https://emacsredux.com/blog/2020/12/04/maximize-the-emacs-frame-on-startup/][https://emacsredux.com/blog/2020/12/04/maximize-the-emacs-frame-on-startup/]]

#+begin_src emacs-lisp :tangle early-init.el
  ;; First frame is full screen
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))

  ;; Do not resize the frame
  (setopt frame-inhibit-implied-resize t)

  ;; enable menu bar mode
  ;; It doesn't take up much space and can be useful occasionally
  (menu-bar-mode 1)

  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setopt inhibit-startup-screen t)
  (setopt use-dialog-box t)                 ; only used for mouse events
  (setopt use-file-dialog nil)              ; don't ever use this

  ;; Usage varies between home and work
  ;; For example, I don't want mu4e or elfeed at work
  (defvar twem2--is-work
    nil
    "Is this running on a work computer?")

  ;; Work computer is a mac
  (when (eq system-type 'darwin)
    (setq twem2--is-work 't))

  (defvar twem2--username
    "tristan"
    "My username varies between work and home")

  (when twem2--is-work
    (setq twem2--username "tristanmills"))


  ;; I don't care about seeing this.
  ;; To disable it, it's value must match my name
  (eval '(setopt inhibit-startup-echo-area-message twem2--username))

  (setopt inhibit-startup-buffer-menu t)
 #+end_src

* The main Emacs initialization file: =init.el=

#+begin_src emacs-lisp :tangle init.el
;;; ...  -*- lexical-binding: t -*-
#+end_src

** Turn off native compilation warnings
#+begin_src emacs-lisp :tangle init.el
  (setq native-comp-async-report-warnings-errors 'silent) ; emacs28 with native compilation
#+end_src

** TODO options to enable or disable loading of modules

** Confirm kill
I have a habit of fat fingering =C-x C-c=
#+begin_src emacs-lisp :tangle init.el
  (setq confirm-kill-emacs 'yes-or-no-p)
#+end_src

** Put Custom changes in their own file
By default Emacs save anything from =M-x customize= at the end of the init file.
I never want this, my init files should only contain code I have written

Here I send it to a temporary file so they are never persisted and I don't need
to worry about it.

#+begin_src emacs-lisp :tangle init.el
  (setopt custom-file (make-temp-file "emacs-custom-"))
#+end_src
** Set up packages
I use =package.el= to install packages. This is built-in.
I did try =straight.el=, but it complicated things too much for too little benefit. Looking at other alternatives,
I remain unconvinced that they solve anything for me (obviously, your mileage might vary - they may be perfect
for your use case)

Prot has a good article about package archives, priorities and pinning: <https://protesilaos.com/codelog/2022-05-13-emacs-elpa-devel/>.
It has convinced me to try out ~gnu-elpa-devel~ and to set priorities
#+begin_src emacs-lisp :tangle init.el
  ;;;; Package management
  (require 'package)


  ;; I want to set projects myself
  (setq package-vc-register-as-project nil) ; Emacs 30

  (add-hook 'package-menu-mode-hook #'hl-line-mode)

  ;; Also read: <https://protesilaos.com/codelog/2022-05-13-emacs-elpa-devel/>
  (setq package-archives
        '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
          ("gnu-elpa-devel" . "https://elpa.gnu.org/devel/")
          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
          ("melpa" . "https://melpa.org/packages/")
  	("melpa-stable" . "https://stable.melpa.org/packages/")))

  ;; Highest number gets priority (what is not mentioned has priority 0)
  (setq package-archive-priorities
        '(("gnu-elpa" . 3)
          ("melpa" . 2)
          ("nongnu" . 1)))

  ;; I don't compile emacs that frequently, and run stable in some situations
  (setq package-install-upgrade-built-in t)
#+end_src
** vc-use-package
Install packages from version control using =package-vc-install= in =use-package=

This is included in the built in =use-package= as of Emacs 30, but is not in the =gnu-elpa= version
(despite having the same version number)

#+begin_src emacs-lisp :tangle init.el
;  (if (version< emacs-version "30")
;     (unless (package-installed-p 'vc-use-package)
;	 (package-vc-install "https://github.com/slotThe/vc-use-package"))
;       (require 'vc-use-package))
#+end_src
** Package pinning
Packages to pin to particular sources
This doesn't actually appear to work for ~built-in~ but I want to document that I want the built-in version of  =use-package=
#+begin_src emacs-lisp :tangle init.el
  ;(setq package-pinned-packages
   ;     '((use-package . "built-in")))

  ;; use latest dev version - see if it fixes issues with diminish
  ;(setq package-pinned-packages '((use-package . "gnu-elpa-devel")))
#+end_src
** install diminish for use with use-package
emacs 31 has built in support for hiding modes in the minibuffer
see ~mode-line-collapse-minor-modes~

#+begin_src emacs-lisp :tangle init.el
;;        (use-package diminish
;;          :ensure t)
#+end_src
** TODO all those basic settings
** Add module and personal lisp sources to the load path
Here I add two directories in my configuration directory (typically =~/.emacs.d/=) to the load-path
- =twem2-config-modules= is the directory where the configuration modules are kept
- =twem2-lisp= is the directory where custom lisp is kept
In both cases the files should provide a package which is loaded below
(again, credit to Prot)
#+begin_src emacs-lisp :tangle init.el
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("twem2-lisp" "twem2-config-modules"))
#+end_src
** Disable Biderection Test Scanning
I don't ever displya right-to-left text. This snippet forces emacs to assume
left-to-right everywhere, skipping the algorithm to support it.
Probably not much more efficient on small files, but on very large ones it'll
have and impact
#+begin_src emacs-lisp :tangle init.el
  (setq-default bidi-display-reordering 'left-to-right
  	      bidi-paragraph-direction 'left-to-right)

  (setopt bidi-inhibit-bpa t)
#+end_src
** Increate Process Output Buffer
The default is 64kB. LSP servers can send far bigger responses, several MB in
some cases.
This will reduce the number of read calls needed, making eglot more efficient

#+begin_src emacs-lisp :tangle init.el
  (setopt read-process-output-max (* 4 1024 1024))
#+end_src
** Kill Ring
*** Save the Clipboard before killing
If you copy from another application and then kill something in emacs then
the clipboard value will be overwritten, and will be lost.
This saves the clipboard value to the kill ring
#+begin_src emacs-lisp :tangle init.el
  (setopt save-interprogram-paste-before-kill t)
#+end_src
*** No duplicates in the kill ring
#+begin_src emacs-lisp :tangle init.el
  (setopt kill-do-not-save-duplicates t)
#+end_src
** savehist-mode
Save the minibuffer history between sessions
Additionally save the kill-ring, search-ring, and regexp-search-ring
#+begin_src emacs-lisp :tangle init.el
  (setopt savehist-file (locate-user-emacs-file "savehist"))
  (setopt history-length 100)
  (setopt history-delete-duplicates t)
  (setopt savehist-save-minibuffer-history t)
  (setopt savehist-additional-variables
  	'(search-ring regexp-search-ring kill-ring))
  (savehist-mode t)
#+end_src


** Load personal lisp packages
#+begin_src emacs-lisp :tangle init.el
  (require 'twem2-org-latex)
  (require 'asdf)
  (require 'twem2-run-test)
  (require 'twem2-scratch)
  (asdf-enable)
#+end_src
** Load modules
Each module ~provides~ a package
#+begin_src emacs-lisp :tangle init.el
  (require 'twem2-org)
  (require 'twem2-essentials)
  (require 'twem2-utils)
  (require 'twem2-ediff)
  (require 'twem2-wsl2)
  (require 'twem2-theme)
  (unless twem2--is-work
    (require 'twem2-email))
  (require 'twem2-completion)
  (require 'twem2-denote)
  (require 'twem2-window)
  ;;  (require 'twem2-bookmarks)
  (require 'twem2-dired)
  (require 'twem2-treesitter)
  (require 'twem2-latex)
  ;; (require 'twem2-web-dev)
  (require 'twem2-eglot)
  (require 'twem2-vc)
  (require 'twem2-markdown)
  (require 'twem2-icons)
  (require 'twem2-python)
  (require 'twem2-ruby)
  (require 'twem2-pdf)
  (require 'twem2-trial)
  (require 'twem2-term)
  (require 'twem2-casual)
  (require 'twem2-typescript)
  (require 'twem2-programming)
  (require 'twem2-project)
  (unless twem2--is-work
    (require 'twem2-elfeed))
  (unless twem2--is-work
    (require 'twem2-irc))
  (require 'twem2-ai)
  (unless twem2--is-work
    (require 'twem2-android))
#+end_src
** Start server
#+begin_src emacs-lisp :tangle init.el
  (require 'server)

  (unless (server-running-p)
    (server-start))
#+end_src

* Essential configuration
Things which are currently essential and will always be loaded.
#+begin_src emacs-lisp :tangle twem2-config-modules/twem2-essentials.el :mkdirp yes
;;; twem2-essentials.el --- Essential configuration -*- lexical-binding: t -*-

(use-package emacs
  :ensure t
  ;; Rebind M-i to imenu
  :bind (("M-i" . imenu)
         ("<f11>" . nil)
         ("C-z" . nil))
  :custom
  ;; Use visible bell rather than making a noise
  (visible-bell t)
  ;; Use tab for completion and indentation
  (tab-always-indent 'complete)
  ;; Highlight the current error
  (next-error-message-highlight t)
  ;; Turn on column-number-mode
  (column-number-mode t)
  ;; Select the help window when its opened
  (help-window-select t)
  :config
  ;; Minor modes to hide (requires emacs 31+)
  (setq mode-line-collapse-minor-modes
        '(eldoc-mode
          buffer-face-mode
          auto-revert-mode
          org-indent-mode
          smartparens-mode
          subword-mode
          jest-test-mode
          which-key-mode
          eldoc-mode))
  (setq mode-line-collapse-minor-modes-to "")
  ;; Turn off backups & lock files
  (setq make-backup-files nil)
  (setq create-lockfiles nil)
  ;; Make compile-mode use ANSI colours
  (add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)
  ;; Strip whitespace on save
  (add-hook 'before-save-hook
            'delete-trailing-whitespace)
  ;; auto-revert-mode
  (global-auto-revert-mode))

;; Set a dictionary for ispell-lookup-words to use
(when (eq system-type 'gnu/linux)
  (setopt ispell-alternate-dictionary "/usr/share/dict/words"))

;; which-key
(use-package which-key
  :ensure t
  :config
  (setq which-key-idle-delay 0.3)
  (setq which-key-popup-type 'minibuffer)
  (which-key-mode))

;; flymake - built-in error checker, used by eglot
;; Also useful: consult-flymake bound to M-g f
(use-package flymake
  :ensure t
  :bind (:map flymake-mode-map
              ("M-p" . flymake-goto-prev-error)
              ("M-n" . flymake-goto-next-error)))

;; Display line numbers in prog and text modes
(use-package emacs
  :ensure t
  :hook ((prog-mode text-mode) . display-line-numbers-mode))

(provide 'twem2-essentials)
#+end_src
* Utilities
Non-essential, but very useful packages and configuration
#+begin_src emacs-lisp :tangle twem2-config-modules/twem2-utils.el :mkdirp yes
  ;;; twem2-ediff.el --- Ediff configuration -*- lexical-binding: t -*-
#+end_src
** Helpful
Improved help buffers
#+begin_src emacs-lisp :tangle twem2-config-modules/twem2-utils.el :mkdirp yes
  (use-package helpful
    :ensure t
    :bind (([remap describe-function] . helpful-callable)
           ([remap describe-key] . helpful-key)
           ([remap describe-variable] . helpful-variable)
           ([remap describe-command] . helpful-command)
  	 ([remap describe-symbol] . helpful-symbol)
           ("C-c C-d" . helpful-at-point)))
#+end_src
** provide twem2-utils
#+begin_src emacs-lisp :tangle twem2-config-modules/twem2-utils.el :mkdirp yes
  (provide 'twem2-utils)
#+end_src
* Ediff configuration
Configure ediff to open in the current tab and restore window configuration on exit.

#+begin_src emacs-lisp :tangle twem2-config-modules/twem2-ediff.el :mkdirp yes
;;; twem2-ediff.el --- Ediff configuration -*- lexical-binding: t -*-

(use-package ediff
  :ensure t
  :custom
  ;; Open ediff in the current frame instead of a new one
  (ediff-window-setup-function 'ediff-setup-windows-plain)
  ;; Split windows horizontally (side-by-side comparison)
  (ediff-split-window-function 'split-window-horizontally)
  :config
  ;; Save window configuration before ediff and restore after
  (defvar my-ediff-window-config nil
    "Window configuration before starting ediff.")

  (defun my-ediff-save-window-config ()
    "Save the current window configuration before starting ediff."
    (setq my-ediff-window-config (current-window-configuration)))

  (defun my-ediff-restore-window-config ()
    "Restore the window configuration saved before ediff."
    (when my-ediff-window-config
      (set-window-configuration my-ediff-window-config)
      (setq my-ediff-window-config nil)))

  (add-hook 'ediff-before-setup-hook #'my-ediff-save-window-config)
  (add-hook 'ediff-quit-hook #'my-ediff-restore-window-config))

(provide 'twem2-ediff)
;;; twem2-ediff.el ends here
#+end_src
* WSL2 configuration
