emacs.org
** twem2-scratch
Create and switch to scratch buffers in any prog or text mode.
#+begin_src emacs-lisp :tangle twem2-lisp/twem2-scratch.el
;;; twem2-scratch.el --- Create scratch buffers in any mode -*- lexical-binding: t; -*-

;; Copyright (C) 2025 Tristan Mills

;; Author: Tristan Mills <tristan@eridu.org.uk>
;; Version: 0.1

;; This file is not part of GNU Emacs.

;;; Commentary:

;; Provides `twem2-scratch' to switch to (or create) a scratch buffer
;; in any mode derived from `text-mode' or `prog-mode'.  A curated
;; list of common modes is offered by default; with a prefix argument,
;; all valid modes are available.  `twem2-scratch-new' always creates
;; a fresh buffer.  Convenience commands `twem2-scratch-org' and
;; `twem2-scratch-elisp' are also provided.

;;; Code:

(defvar twem2-scratch-modes
  '(org-mode emacs-lisp-mode markdown-mode text-mode
    python-ts-mode json-ts-mode typescript-ts-mode)
  "List of modes offered when `twem2-scratch' is called interactively.
With a prefix argument, all `text-mode' and `prog-mode' derivatives are offered instead.")

(defun twem2--scratch-all-modes ()
  "Return all modes derived from `text-mode' or `prog-mode'."
  (let (modes)
    (mapatoms
     (lambda (sym)
       (when (and (functionp sym)
                  (provided-mode-derived-p sym 'text-mode 'prog-mode))
         (push sym modes))))
    (sort modes (lambda (a b) (string< (symbol-name a) (symbol-name b))))))

(defun twem2--scratch-mode-name (mode)
  "Derive a short name from MODE symbol by stripping the -mode suffix."
  (let ((name (symbol-name mode)))
    (if (string-suffix-p "-mode" name)
        (substring name 0 (- (length name) 5))
      name)))

(defun twem2--scratch-read-mode (all)
  "Prompt for a mode using `completing-read'.
When ALL is non-nil, offer all valid modes instead of `twem2-scratch-modes'."
  (intern
   (completing-read "Mode: "
                    (mapcar #'symbol-name
                            (if all
                                (twem2--scratch-all-modes)
                              twem2-scratch-modes))
                    nil t)))

(defun twem2--scratch-find-buffer (mode)
  "Find an existing scratch buffer in MODE, or nil if none exists."
  (let ((prefix (concat "*scratch-" (twem2--scratch-mode-name mode))))
    (seq-find (lambda (buf)
                (with-current-buffer buf
                  (and (string-prefix-p prefix (buffer-name buf))
                       (derived-mode-p mode))))
              (buffer-list))))

(defun twem2--scratch-create-buffer (mode)
  "Create a new scratch buffer in MODE and return it."
  (unless (provided-mode-derived-p mode 'text-mode 'prog-mode)
    (user-error "Mode %s is not derived from text-mode or prog-mode" mode))
  (let* ((base (concat "*scratch-" (twem2--scratch-mode-name mode)))
         (n 0)
         bufname)
    (catch 'done
      (while t
        (setq bufname (concat base
                              (if (= n 0) "" (int-to-string n))
                              "*"))
        (setq n (1+ n))
        (when (not (get-buffer bufname))
          (let ((buffer (get-buffer-create bufname)))
            (with-current-buffer buffer
              (funcall mode))
            (throw 'done buffer)))))))

(defun twem2-scratch (&optional mode)
  "Switch to an existing scratch buffer in MODE, or create one.
MODE defaults to `org-mode'.  When called interactively, prompt
for a mode from `twem2-scratch-modes'.  With a prefix argument,
offer all modes derived from `text-mode' or `prog-mode'."
  (interactive (list (twem2--scratch-read-mode current-prefix-arg)))
  (let* ((mode (or mode 'org-mode))
         (buffer (or (twem2--scratch-find-buffer mode)
                     (twem2--scratch-create-buffer mode))))
    (display-buffer buffer t)))

(defun twem2-scratch-new (&optional mode)
  "Create a new scratch buffer in MODE.
MODE defaults to `org-mode'.  When called interactively, prompt
for a mode from `twem2-scratch-modes'.  With a prefix argument,
offer all modes derived from `text-mode' or `prog-mode'."
  (interactive (list (twem2--scratch-read-mode current-prefix-arg)))
  (let* ((mode (or mode 'org-mode))
         (buffer (twem2--scratch-create-buffer mode)))
    (display-buffer buffer t)))

(defun twem2-scratch-org ()
  "Switch to an org scratch buffer, or create one.
With a prefix argument, always create a new buffer."
  (interactive)
  (if current-prefix-arg
      (twem2-scratch-new 'org-mode)
    (twem2-scratch 'org-mode)))

(defun twem2-scratch-elisp ()
  "Switch to an elisp scratch buffer, or create one.
With a prefix argument, always create a new buffer."
  (interactive)
  (if current-prefix-arg
      (twem2-scratch-new 'emacs-lisp-mode)
    (twem2-scratch 'emacs-lisp-mode)))

(provide 'twem2-scratch)
;;; twem2-scratch.el ends here
#+end_src
** twem2-lint-fix
Auto-detect project linters and run fix commands on the current file.
#+begin_src emacs-lisp :tangle twem2-lisp/twem2-lint-fix.el
;;; twem2-lint-fix.el --- Auto-detect and run project linters -*- lexical-binding: t; -*-

;; Copyright (C) 2025 Tristan Mills

;; Author: Tristan Mills <tristan@eridu.org.uk>
;; Version: 0.1

;; This file is not part of GNU Emacs.

;;; Commentary:

;; Detects which linters are configured in the current project (Biome,
;; ESLint, Prettier) by checking for their config files, then provides
;; `lint-fix-file' to run the appropriate fix commands on the current
;; buffer.  `lint-fix-file-and-revert' additionally reverts the buffer
;; after fixing.

;;; Code:

(require 'seq)
(require 'project)

(defvar twem2-lint-fix-linters
  '((biome
     :configs ("biome.json" "biome.jsonc")
     :command "npx biome format --write %s && npx biome lint --write %s")
    (eslint
     :configs (".eslintrc" ".eslintrc.js" ".eslintrc.cjs"
               ".eslintrc.json" ".eslintrc.yml" ".eslintrc.yaml"
               "eslint.config.js" "eslint.config.mjs" "eslint.config.cjs")
     :command "npx eslint --fix %s")
    (prettier
     :configs (".prettierrc" ".prettierrc.json" ".prettierrc.yml"
               ".prettierrc.yaml" ".prettierrc.json5" ".prettierrc.toml"
               "prettier.config.js" "prettier.config.cjs" "prettier.config.mjs")
     :command "npx prettier --write %s"))
  "Alist of linters to detect and run.
Each entry is (NAME :configs FILES :command COMMAND).
COMMAND is a format string where %s is replaced with the file path.")

(defun twem2--project-has-config-p (root filenames)
  "Return non-nil if any of FILENAMES exist in ROOT."
  (seq-some (lambda (f) (file-exists-p (expand-file-name f root))) filenames))

(defun twem2--detect-linters ()
  "Detect which linters to run based on config files in the project root.
Returns a list of matching entries from `twem2-lint-fix-linters'."
  (when-let* ((proj (project-current))
              (root (project-root proj)))
    (seq-filter
     (lambda (entry)
       (twem2--project-has-config-p root (plist-get (cdr entry) :configs)))
     twem2-lint-fix-linters)))

(defun lint-fix-file ()
  "Run the appropriate linter --fix on the current file based on project config."
  (interactive)
  (let ((file (buffer-file-name))
        (linters (twem2--detect-linters)))
    (dolist (linter linters)
      (let ((name (car linter))
            (cmd (plist-get (cdr linter) :command)))
        (message "%s fixing %s" name file)
        (shell-command (format cmd file))))))

(defun lint-fix-file-and-revert ()
  (interactive)
  (lint-fix-file)
  (revert-buffer t t))

(provide 'twem2-lint-fix)
;;; twem2-lint-fix.el ends here
#+end_src
* ------ below here is not yet brought in ------

** TODO things to try out
p
*
*** TODO more consult
- consult-dir
** 29.1 bugfix for tramp 2.6.1.1.1                                :disabled:
Fix from notes about GNU ELPA version
#+begin_src emacs-lisp
  (when (string-equal emacs-version "29.1")
    (with-current-buffer
        (url-retrieve-synchronously
         "https://git.savannah.gnu.org/cgit/emacs.git/plain/lisp/emacs-lisp/loaddefs-gen.el?h=emacs-29")
      (goto-char (point-min))
      (while (looking-at "^.+$") (forward-line))
      (eval-region (point) (point-max))))
#+end_src


** Miscellaneous settings

A collection of settings which don't fit elsewhere. Mostly just small usability settings.

*** Fringe mode
Add a small fringe to the window

Using the width of one char so mu4e headings line up

#+name: fringe-mode
#+begin_src emacs-lisp
  (defun update-fringe ()
    "Update the fringe to one char"
    (interactive)
    (if window-system
        (set-fringe-style (frame-char-width))))

  (push 'update-fringe after-make-frame-functions)
#+end_src

*** Visual bell
Flash don't beep

#+name: visual bell
#+begin_src emacs-lisp
  (setq visible-bell t)
#+end_src
*** Column numbers
Show column in the modeline

#+name: column numbers
#+begin_src emacs-lisp

#+end_src

*** Better defaults
[[https://git.sr.ht/~technomancy/better-defaults][Better Defaults]] provides quite a few changes to Emacs's defaults, these are all taken from there



**** save-place-mode
See [[https://www.emacswiki.org/emacs/SavePlace][https://www.emacswiki.org/emacs/SavePlace]] - this will save your place in a buffer
#+name: save-place-mode
#+begin_src emacs-lisp
  (save-place-mode 1)
#+end_src


*** increase gc-cons-threshold
Should help with slowdowns due to eglot / lsp communication using lots of memory
#+begin_src emacs-lisp
  (setq gc-cons-threshold 100000000)
#+end_src

*** Increase amount of data read from a process
More potential eglot / lsp improvement
#+begin_src emacs-lisp
  (setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src

